

motivation_art = r'''
  _________________________________
| У тебя всё получится! Я уверенна! |
  =================================
                                   \
                                    \
                                     /\     /\
                                    {  `---'  }
                                    {  O   O  }
                                    ~~>  V  <~~
                                     \  \|/  /
                                      `-----'____
                                      /     \    \_
                                     {       }\  )_\_   _
                                     |  \_/  |/ /  \_\_/ )
                                      \__/  /(_/     \__/
                                        (__/
'''

def say() -> None:
    """Выводит мотивационное сообщение и ASCII-рисунок."""
    print(motivation_art)