Repository: pypi-data/pypi-mirror-347
Catalog: packages/rer.ufficiostampa/rer.ufficiostampa-2.0.2.tar.gz/rer.ufficiostampa-2.0.2/src/rer/ufficiostampa/locales/*/LC_MESSAGES/rer.ufficiostampa.po
Languages: it

source: Actions
it: Azioni

source: Add Subscriber
it: Aggiungi iscritto

source: Are you sure you want to delete all history?
it: Sei sicuro di voler cancellare tutto lo storico?

source: Are you sure you want to delete all subscriptions?
it: Sei sicuro di voler cancellare tutti gli iscritti?

source: Are you sure you want to delete this subscribed users?
it: Sei sicuro di volere eliminare questi utenti iscritti?

source: Are you sure you want to uncheck this item
it: Sei sicuro di voler eliminare

source: CSV file should have following columns: name, surname, email, phone, channels, newspaper, date.
it: Il file CSV deve avere le seguenti colonne: name, surname, email, phone, channels, newspaper, date.

source: Cancel
it: Annulla

source: Changes canceled.
it: Modifiche annullate.

source: Channels management
it: Gestione degli iscritti

source: Clean all data before import
it: Azzera tutti i dati prima di importare

source: Completed Date
it: Concluso

source: Date
it: Data di invio

source: Delete
it: Elimina

source: Delete all history
it: Cancella tutto lo storico

source: Delete all subscriptions
it: Cancella tutti gli iscritti

source: Edit
it: Modifica

source: Edit Subscriber
it: Modifica iscritto

source: Errored rows
it: Righe errate

source: Export in CSV
it: Esporta in CSV

source: Filter history
it: Cerca nel titolo

source: Filter subscribers
it: Filtra gli iscritti

source: First row should be filled with column names. Actual values should start from the second one.
it: La prima riga deve contenere i nomi delle colonne. Gli iscritti devono iniziare dalla seconda.

source: History management
it: Storico invio comunicati

source: Import from CSV
it: Importa da CSV

source: Imported rows
it: Righe importate

source: Installs the rer.ufficiostampa add-on.
it: Installa the rer.ufficiostampa.

source: Name
it: Nome

source: No send history found
it: Nessuno dato presente

source: No subscribers found
it: Nessun iscritto trovato

source: Number
it: Numero

source: Overwrite duplicates
it: Sovrascrivi i duplicati

source: Recipients
it: Destinatari

source: Remove file
it: Rimuovi il file selezionato

source: Required
it: Obbligatorio

source: Row
it: Riga

source: Save
it: Salva

source: Search...
it: Cerca...

source: Select a channel
it: Seleziona un canale

source: Select a type
it: Seleziona una tipologia

source: Select at least one channel
it: Seleziona almeno un canale

source: Settings
it: Impostazioni

source: Skipped rows
it: Righe ignorate

source: Status
it: Stato

source: Subscribers
it: Iscritti

source: Surname
it: Cognome

source: Text
it: Testo

source: Type
it: Tipologia

source: Ufficio Stampa settings
it: Configurazione Ufficio Stampa

source: Uninstalls the rer.ufficiostampa add-on.
it: Disinstalla rer.ufficiostampa.

source: View Comunicato
it: Vista Comunicato

source: View Invito
it: Vista Invito

source: additional_addresses_description
it: Inserisci una lista di indirizzi email aggiuntivi che riceveranno questa mail. Uno per riga. Puoi utilizzare questo campo (senza selezionare dei canali) anche per fare degli invii di prova prima di inviarla a tutti i destinatari. Gli invii di prova non verranno tracciati nello storico.

source: additional_addresses_title
it: Indirizzi aggiuntivi

source: address_already_registered
it: Indirizzo e-mail già iscritto.

source: arguments_help
it: Seleziona uno o più valori possibili.

source: arguments_label
it: Argomenti

source: cancel_action
it: Azione annullata

source: cancel_button
it: Annulla

source: cancel_subscription_subject_label
it: Gestisci la cancellazione dai canali di ${site}

source: cancel_subscriptions_request_help
it: Se vuoi cancellarti da uno o più canali, inserisci il tuo indirizzo e-mail nell’apposito campo. Riceverai una e-mail con un link per confermare. Il link scadrà entro 24 ore.

source: cancel_subscriptions_request_title
it: Cancellami

source: cancel_subscriptions_send_success
it: Riceverai un'e-mail con il link per gestire la cancellazione.

source: cancel_subscriptions_success
it: Cancellazione registrata.

source: channels
it: Canali

source: channels_management_label
it: Gestione degli iscritti

source: comunicati_search_created_label
it: Data

source: comunicati_search_text_label
it: Ricerca testuale

source: comunicati_stampa_layout
it: Comunicati Stampa

source: comunicato_number_help
it: Il numero dell'ultimo comunicato spedito. Questo valore si aggiorna automaticamente ad ogni pubblicazione di un nuovo comunicato stampa.

source: comunicato_number_label
it: Numero comunicato

source: comunicato_published_on
it: Pubblicato il

source: comunicato_year_help
it: Non devi modificare questo valore. E' aggiornato automaticamente ogni anno.

source: comunicato_year_label
it: Anno comunicato

source: confirm_click_on_label
it: Clicca sul

source: confirm_expire
it: Questo link ha una validità di 24 ore.

source: confirm_help
it: Hai ricevuto questa e-mail perché è stata richiesta la cancellazione dai canali di ${site_title}.

source: confirm_ignore_label
it: o ignora questa e-mail.

source: confirm_link_label
it: link di conferma

source: css_styles_help
it: Inserisci una serie di stili CSS per le mail invitate.

source: css_styles_label
it: Stili

source: delete_subscriptions_link
it: Per cancellarti

source: empty_subscribers
it: Devi selezionare almeno un canale o indirizzo email.

source: error_reading_csv
it: Errore in lettura del file csv.

source: error_send_mail
it: Si è verificato un errore invitando le mail. Contatta l'amministratore del sito.

source: external_sender_url_help
it: Se vuoi inviare le email con un tool esterno (rer.newsletterdispatcher.flask), inserisci qui l'url del servizio. Se vuoto, tutte le email verranno spedite da Plone.

source: external_sender_url_label
it: URL servizio di invio esterno

source: from_label
it: Dal

source: frontend_url_help
it: Se il sito pubblico è accessibile da un URL diversa da quella redazionale, inserisci qui l'URL pubblico. Tutti i link all'interno delle email verranno convertiti con l'URL pubblico.

source: frontend_url_label
it: URL di frontend

source: go_to_search_filters
it: Vai ai filtri

source: go_to_search_results
it: Vai ai risultati

source: history_management_label
it: Storico invio comunicati

source: is not valid
it: non valido

source: is required
it: obbligatorio

source: item_selected
it: elemento selezionato

source: items_selected
it: elementi selezionati

source: label_legislature
it: Legislatura

source: label_portal_type
it: Tipo

source: label_sent
it: Inviato

source: label_title
it: Titolo

source: legislature_arguments_help
it: Inserisci una lista di argomenti a cui si fa riferimento.

source: legislature_arguments_label
it: Argomenti

source: legislature_criteria_label
it: Legislatura

source: legislature_help
it: Inserisci il nome della legislatura.

source: legislature_label
it: Legislatura

source: legislatures_help
it: Questa è una lista di legislature. L'ultima inserita è quella utilizzata per popolare i campi dei Comunicati e Inviti.

source: legislatures_label
it: Elenco Legislature

source: manage_subscriptions_channels_title
it: Disattiva la selezione dal canale da cui vuoi cancellarti.

source: manage_subscriptions_email_title
it: Email

source: manage_subscriptions_help
it: Questa è la lista dei canali a cui sei iscritto.

source: manage_subscriptions_inexistent_mail
it: Email non trovata. Impossibile aggiornare i dati.

source: manage_subscriptions_intro
it: Stai ricevendo questa email perché sei iscritto al sito ${site_title}

source: manage_subscriptions_link
it: Gestisci le tue iscrizioni

source: manage_subscriptions_not_send
it: Impossibile spedire il link per la gestione delle iscrizioni. Per favore contatta l'amministratore del sito.

source: manage_subscriptions_request_inexistent_mail
it: Email non trovata. Impossibile spedire la mail con il link.

source: manage_subscriptions_request_serializer_error
it: Secret e salt non impostati nel pannello di controllo. Impossibile inviare il link.

source: missing_file
it: Devi caricare almeno un file.

source: newspaper
it: Testata giornalistica

source: notes_description
it: Note aggiuntive.

source: notes_title
it: Note

source: phone
it: Telefono

source: press_attachments
it: Allegati

source: refine_search_label
it: Raffina la tua ricerca

source: resend_link
it: Invia di nuovo

source: reset_filters_label
it: Rimuovi tutti i filtri

source: results_tot_label
it: Trovato ${variable} risultato

source: results_tot_label_multi
it: Trovati ${variable} risultati

source: revoke_subscription_label
it: si è cancellato dai seguenti canali:

source: save
it: Salva

source: save_button
it: Salva

source: search_comunicati_label
it: Ricerca Comunicati

source: select_noOptionsMessage
it: Nessun valore

source: select_placeholder_multi
it: Seleziona uno o più valori

source: send_attachments_description
it: Seleziona quali allegati vuoi inviare via email. Puoi selezionare solamente le Immagini e i File di primo livello.

source: send_attachments_title
it: Allegati

source: send_button
it: Invia

source: send_channels_description
it: Seleziona quali canali devono ricevere questa comunicazione. Tutti gli indirizzi email assegnati ai canali selezionati riceveranno il messaggio.

source: send_channels_title
it: Canali

source: send_date_label
it: Data ${date}

source: send_form_help
it: Invia questa comunicazione ad una lista di indirizzi.

source: send_form_title
it: Invia ${type}

source: send_link
it: Invia

source: send_preview_link
it: Anteprima

source: skip_duplicate
it: [${row}] - "${email}" già presente

source: skip_duplicate_multiple
it: [${row}] - Valori multipli nel db per "${email}"

source: skip_unable_to_add
it: [${row}] - impossibile aggiungere

source: subscription_channels_description
it: Elenco dei vari canali a cui ci si può iscrivere. Uno per riga. Questi canali verranno usati per le iscrizioni e per selezionare a chi inviare i comunicati.

source: subscription_channels_label
it: Canali

source: subscriptions_updated_label
it: Cancellazione dai canali di ${site}

source: success_send_mail
it: Invio completato.

source: success_send_mail_async
it: Invio correttamente accodato. Puoi controllare il suo stato nello storico degli invii.

source: to_label
it: Al

source: toggle_filters_label
it: Apri/chiudi i filtri

source: token_salt_help
it: Inserisci il salt per la generazione del token. E' una stringa che in unione con il secret, serve a generare token univoci per i link di gestione delle iscrizioni.

source: token_salt_label
it: Token salt

source: token_secret_help
it: Inserisci la chiave segreta per la generazione dei token.

source: token_secret_label
it: Token secret

source: unsubscribe_confirm_invalid_email
it: Impossibile gestire le iscrizioni. Email non valida.

source: unsubscribe_confirm_invalid_id
it: Impossibile gestire le iscrizioni. Id non valido.

source: unsubscribe_confirm_invalid_parameters
it: Impossibile gestire le iscrizioni. Parametri non validi.

source: unsubscribe_confirm_secret_expired
it: Impossibile gestire le iscrizioni. Token scaduto.

source: unsubscribe_confirm_secret_invalid
it: Impossibile gestire le iscrizioni. Token non valido.

source: unsubscribe_confirm_secret_null
it: Impossibile gestire le iscrizioni. Token non presente.

source: unsubscribe_confirm_secret_token_settings_error
it: Impossibile gestire le iscrizioni. Chiavi per il token non impostate nel pannello di controllo.

source: validation_invalid_email
it: Indirizzo email non valido: ${address}

source: wrong_content_type
it: Devi caricare un file csv.
