NOTE_PROVIDER_PROMPT = """这是人设账号中中的第{index}个帖子
标题：{title}
正文: {body_text}
还有如下图片
"""

REFERENCE_NOTE_PROVIDER_PROMPT = """这是刺激源帖子信息：
标题：{title}
正文: {body_text}
还有如下图片/视频
"""


SYSTEM_INSTRUCTION_PROMPT="""你是小红书的创作专家
我会提供我账号下历史创作的所有帖子，和一个新的刺激源帖子
你将帮我完成关于`基于账号人设的选题创作`相关任务"""


REFERENCE_NOTE_AVAILABLE_PROMPT = """以上就是我给出的`人设账号所有帖子`和`刺激源帖子`
我的账号名：{account_name}
我的账号描述: {account_description}

下面请你帮我基于我历史账号的帖子和刺激源帖子，帮我完成以下任务：
- 基于`人设账号所有帖子`总结我的创作方向所属品类
- 分析用户选题的方向、关键点、风格
- 总结我内容创作中关于选题的常见方式、方法、技巧、特征等信息
    - 这些信息将会指导后续具体的选题的创作
- 然后基于上述的人设选题分析来对刺激源帖子进行分析：
    - 找到刺激源帖子的亮点
    - 找到能够跟我账号人设相结合的选题方向
        - 并不是所有的刺激源，我都会用来进行创作，我会从我自己的账号人设出发，理解刺激源和我结合的可能性；
        - 请注意我的创作目标是要创作出高质量的内容，平平无奇的选题不是我的目标;
- 给出最终的结果
    - 如果刺激源能够跟帖子结合，则输出结合的思路
    - 如果不能结合，则输出'无法产生选题'，并给出理由
    
任务完成要求：
- 你需要从账号历史帖子中进行人设客观的总结
- 你不要给我最后的选题结果，我只要客观的人设信息、刺激源分析和能否结合的结果以及结合思路；
    - 如果无法结合，请务必在输出中包括`无法产生选题`
- 对于能否结合，眼睛过度联想，而是从基于人设内容创作的底层逻辑出发，判断依据干净利落：
    - 一定要符合人设，否则无法结合
    - 一定要有刺激源的亮点/要点，否则无法结合
    
"""
